; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v8 - type_3 ?v6 - type_2)
 	      (pred_3 ?v4 - object ?v6 - type_2)
	      (pred_4 ?v8 - type_3 ?v5 - type_1)
	      (pred_2 ?v8 - type_3 ?v4 - object ?v5 - type_1))

   (:action op_1
       :parameters  (?v8 - type_3 ?v3 ?v7 - type_2)
       :precondition (and  (pred_1 ?v8 ?v3))
       :effect (and  (pred_1 ?v8 ?v7)
		     (not (pred_1 ?v8 ?v3))))

   (:action op_3
       :parameters (?v8 - type_3 ?v1 - object ?v2 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v2) (pred_1 ?v8 ?v2) (pred_4 ?v8 ?v5))
       :effect (and (pred_2 ?v8 ?v1 ?v5)
		    (not (pred_3 ?v1 ?v2)) 
		    (not (pred_4 ?v8 ?v5))))

   (:action op_2
       :parameters (?v8 - type_3 ?v1 - object ?v2 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v8 ?v1 ?v5) (pred_1 ?v8 ?v2))
       :effect (and (pred_3 ?v1 ?v2)
		    (pred_4 ?v8 ?v5)
		    (not (pred_2 ?v8 ?v1 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_03 - type_3
obj_05 obj_06 - type_1
obj_01 obj_07 obj_08 - type_2
obj_04 obj_02 obj_09 - object)
(:init
(pred_1 obj_03 obj_07)
(pred_4 obj_03 obj_05)
(pred_4 obj_03 obj_06)
(pred_3 obj_04 obj_08)
(pred_3 obj_02 obj_01)
(pred_3 obj_09 obj_08)
)
(:goal
(and
(pred_3 obj_04 obj_07)
(pred_3 obj_02 obj_01)
(pred_3 obj_09 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_03 ?b obj_06))))
)
)

; plan
1. (op_1 obj_03 obj_07 obj_08)
   deleted: (pred_1 obj_03 obj_07)
   added: (pred_1 obj_03 obj_08)
   goals met: 2 of 3
2. (op_3 obj_03 obj_04 obj_08 obj_05)
   deleted: (pred_3 obj_04 obj_08) (pred_4 obj_03 obj_05)
   added: (pred_2 obj_03 obj_04 obj_05)
   goals met: 2 of 3
3. (op_1 obj_03 obj_08 obj_07)
   deleted: (pred_1 obj_03 obj_08)
   added: (pred_1 obj_03 obj_07)
   goals met: 2 of 3
4. (op_2 obj_03 obj_04 obj_07 obj_05)
   deleted: (pred_2 obj_03 obj_04 obj_05)
   added: (pred_3 obj_04 obj_07) (pred_4 obj_03 obj_05)
   goals met: 3 of 3
